_Rarzrabotki/Kazna/DataProcessors/А_ТестерВиз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>А_ТестерВиз</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СоставСхемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиВизирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственные</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Kazna/InformationRegisters/ОпределениеСхемыВизированияПоСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОпределениеСхемыВизированияПоСчетам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СхемаВизирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемыВизирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗатрат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте банковского счета (кассы)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/InformationRegisters/ИдентификацияВизирующихПоРолям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ИдентификацияВизирующихПоРолям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Переадресация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереадресацияС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереадресацияДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переадресант</Name>
					<Comment>ИО пользователя на данной роли</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиВизирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/DataProcessors/А_ТестерВиз/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПроверитьНаСервере()
	
	//Схема визирования                                                      
	ПараметрыСхемыВизирования = Новый Структура();
	ПараметрыСхемыВизирования.Вставить("Подразделение",Подразделение);
	ПараметрыСхемыВизирования.Вставить("Организация",Организация);
	ПараметрыСхемыВизирования.Вставить("ВидОплаты",ВидОплаты);
	ПараметрыСхемыВизирования.Вставить("Сумма",Сумма);
	ПараметрыСхемыВизирования.Вставить("СтатьяДвиженияДенежныхСредств",СтатьяДДС);
	ПараметрыСхемыВизирования.Вставить("Направление",Направление);
	ПараметрыСхемыВизирования.Вставить("Должность",Инициатор.Должность);
	
	СхемаВизирования =РегистрыСведений.ОпределениеСхемыВизированияПоСчетам.ПолучитьСхемуВизирования(ПараметрыСхемыВизирования);
	
	Объект.СоставСхемы.Очистить();
	//РегистрыСведений.ОпределениеСхемыВизированияПоСчетам.ПолучитьМассивВизерейПоСхеме(СхемаВизирования);
	Для каждого Стр Из СхемаВизирования.Роли Цикл
		нСТр = Объект.СоставСхемы.Добавить();
		нСТр.Роль =Стр.Роль;
		
		ПараметрыСхемыВизирования.Вставить("Роль",Стр.Роль);
		МассивПользователей = РегистрыСведений.ИдентификацияВизирующихПоРолям.ПолучитьМассивПользователей(ПараметрыСхемыВизирования);
		Для Каждого Строка Из МассивПользователей Цикл 
			нСТр.Ответственные = нСТр.Ответственные+Строка+", ";
		КонецЦикла;           
		нСТр.Ответственные= Сред(нСТр.Ответственные,1,СтрДлина(нСТр.Ответственные)-2) ;
		ПараметрыСхемыВизирования.Удалить("Роль");
	КонецЦикла;
	
	
	////Визирущие 
	//ПараметрыОтбора = Новый Структура("Подразделение, СтатьяДвиженияДенежныхСредств, ВидОплаты, Организация, Сумма, ВидЗатрат,Направление");
	//ЗаполнитьЗначенияСвойств(ПараметрыОтбора, ЭтотОбъект);
	//ПараметрыОтбора.Вставить("Роль", Роль);
	//МассивПользователей = РегистрыСведений.ИдентификацияВизирующихПоРолям.ПолучитьМассивПользователей(ПараметрыОтбора);
	//ТекущиеВизирующие.Очистить();
	//Для Каждого Строка Из МассивПользователей Цикл 
	//	ТекущиеВизирующие.Добавить().Пользователь = Строка;
	//КонецЦикла;

	
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	ПроверитьНаСервере();
КонецПроцедуры
